/* automatically generated by rust-bindgen 0.71.1 */

pub const OQS_KEM_alg_bike_l1: &[u8; 8] = b"BIKE-L1\0";
pub const OQS_KEM_alg_bike_l3: &[u8; 8] = b"BIKE-L3\0";
pub const OQS_KEM_alg_bike_l5: &[u8; 8] = b"BIKE-L5\0";
pub const OQS_KEM_alg_classic_mceliece_348864: &[u8; 24] = b"Classic-McEliece-348864\0";
pub const OQS_KEM_alg_classic_mceliece_348864f: &[u8; 25] = b"Classic-McEliece-348864f\0";
pub const OQS_KEM_alg_classic_mceliece_460896: &[u8; 24] = b"Classic-McEliece-460896\0";
pub const OQS_KEM_alg_classic_mceliece_460896f: &[u8; 25] = b"Classic-McEliece-460896f\0";
pub const OQS_KEM_alg_classic_mceliece_6688128: &[u8; 25] = b"Classic-McEliece-6688128\0";
pub const OQS_KEM_alg_classic_mceliece_6688128f: &[u8; 26] = b"Classic-McEliece-6688128f\0";
pub const OQS_KEM_alg_classic_mceliece_6960119: &[u8; 25] = b"Classic-McEliece-6960119\0";
pub const OQS_KEM_alg_classic_mceliece_6960119f: &[u8; 26] = b"Classic-McEliece-6960119f\0";
pub const OQS_KEM_alg_classic_mceliece_8192128: &[u8; 25] = b"Classic-McEliece-8192128\0";
pub const OQS_KEM_alg_classic_mceliece_8192128f: &[u8; 26] = b"Classic-McEliece-8192128f\0";
pub const OQS_KEM_alg_hqc_128: &[u8; 8] = b"HQC-128\0";
pub const OQS_KEM_alg_hqc_192: &[u8; 8] = b"HQC-192\0";
pub const OQS_KEM_alg_hqc_256: &[u8; 8] = b"HQC-256\0";
pub const OQS_KEM_alg_kyber_512: &[u8; 9] = b"Kyber512\0";
pub const OQS_KEM_alg_kyber_768: &[u8; 9] = b"Kyber768\0";
pub const OQS_KEM_alg_kyber_1024: &[u8; 10] = b"Kyber1024\0";

pub const OQS_KEM_frodokem_640_shake_length_ciphertext: u32 = 9720;
pub const OQS_KEM_frodokem_640_shake_length_shared_secret: u32 = 16;
pub const OQS_KEM_frodokem_640_shake_length_keypair_seed: u32 = 0;
pub const OQS_KEM_frodokem_976_aes_length_public_key: u32 = 15632;
pub const OQS_KEM_frodokem_976_aes_length_secret_key: u32 = 31296;
pub const OQS_KEM_frodokem_976_aes_length_ciphertext: u32 = 15744;
pub const OQS_KEM_frodokem_976_aes_length_shared_secret: u32 = 24;
pub const OQS_KEM_frodokem_976_aes_length_keypair_seed: u32 = 0;
pub const OQS_KEM_frodokem_976_shake_length_public_key: u32 = 15632;
pub const OQS_KEM_frodokem_976_shake_length_secret_key: u32 = 31296;
pub const OQS_KEM_frodokem_976_shake_length_ciphertext: u32 = 15744;
pub const OQS_KEM_frodokem_976_shake_length_shared_secret: u32 = 24;
pub const OQS_KEM_frodokem_976_shake_length_keypair_seed: u32 = 0;
pub const OQS_KEM_frodokem_1344_aes_length_public_key: u32 = 21520;
pub const OQS_KEM_frodokem_1344_aes_length_secret_key: u32 = 43088;
pub const OQS_KEM_frodokem_1344_aes_length_ciphertext: u32 = 21632;
pub const OQS_KEM_frodokem_1344_aes_length_shared_secret: u32 = 32;
pub const OQS_KEM_frodokem_1344_aes_length_keypair_seed: u32 = 0;
pub const OQS_KEM_frodokem_1344_shake_length_public_key: u32 = 21520;
pub const OQS_KEM_frodokem_1344_shake_length_secret_key: u32 = 43088;
pub const OQS_KEM_frodokem_1344_shake_length_ciphertext: u32 = 21632;
pub const OQS_KEM_frodokem_1344_shake_length_shared_secret: u32 = 32;
pub const OQS_KEM_frodokem_1344_shake_length_keypair_seed: u32 = 0;
unsafe extern "C" {
    pub fn OQS_KEM_alg_identifier(i: usize) -> *const ::libc::c_char;
}
unsafe extern "C" {
    pub fn OQS_KEM_alg_count() -> ::libc::c_int;
}
unsafe extern "C" {
    pub fn OQS_KEM_alg_is_enabled(method_name: *const ::libc::c_char) -> ::libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct OQS_KEM {
    pub method_name: *const ::libc::c_char,
    pub alg_version: *const ::libc::c_char,
    pub claimed_nist_level: u8,
    pub ind_cca: bool,
    pub length_public_key: usize,
    pub length_secret_key: usize,
    pub length_ciphertext: usize,
    pub length_shared_secret: usize,
    pub length_keypair_seed: usize,
    pub keypair_derand: ::core::option::Option<
        unsafe extern "C" fn(
            public_key: *mut u8,
            secret_key: *mut u8,
            seed: *const u8,
        ) -> OQS_STATUS,
    >,
    pub keypair: ::core::option::Option<
        unsafe extern "C" fn(public_key: *mut u8, secret_key: *mut u8) -> OQS_STATUS,
    >,
    pub encaps: ::core::option::Option<
        unsafe extern "C" fn(
            ciphertext: *mut u8,
            shared_secret: *mut u8,
            public_key: *const u8,
        ) -> OQS_STATUS,
    >,
    pub decaps: ::core::option::Option<
        unsafe extern "C" fn(
            shared_secret: *mut u8,
            ciphertext: *const u8,
            secret_key: *const u8,
        ) -> OQS_STATUS,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of OQS_KEM"][::core::mem::size_of::<OQS_KEM>() - 96usize];
    ["Alignment of OQS_KEM"][::core::mem::align_of::<OQS_KEM>() - 8usize];
    ["Offset of field: OQS_KEM::method_name"]
        [::core::mem::offset_of!(OQS_KEM, method_name) - 0usize];
    ["Offset of field: OQS_KEM::alg_version"]
        [::core::mem::offset_of!(OQS_KEM, alg_version) - 8usize];
    ["Offset of field: OQS_KEM::claimed_nist_level"]
        [::core::mem::offset_of!(OQS_KEM, claimed_nist_level) - 16usize];
    ["Offset of field: OQS_KEM::ind_cca"][::core::mem::offset_of!(OQS_KEM, ind_cca) - 17usize];
    ["Offset of field: OQS_KEM::length_public_key"]
        [::core::mem::offset_of!(OQS_KEM, length_public_key) - 24usize];
    ["Offset of field: OQS_KEM::length_secret_key"]
        [::core::mem::offset_of!(OQS_KEM, length_secret_key) - 32usize];
    ["Offset of field: OQS_KEM::length_ciphertext"]
        [::core::mem::offset_of!(OQS_KEM, length_ciphertext) - 40usize];
    ["Offset of field: OQS_KEM::length_shared_secret"]
        [::core::mem::offset_of!(OQS_KEM, length_shared_secret) - 48usize];
    ["Offset of field: OQS_KEM::length_keypair_seed"]
        [::core::mem::offset_of!(OQS_KEM, length_keypair_seed) - 56usize];
    ["Offset of field: OQS_KEM::keypair_derand"]
        [::core::mem::offset_of!(OQS_KEM, keypair_derand) - 64usize];
    ["Offset of field: OQS_KEM::keypair"][::core::mem::offset_of!(OQS_KEM, keypair) - 72usize];
    ["Offset of field: OQS_KEM::encaps"][::core::mem::offset_of!(OQS_KEM, encaps) - 80usize];
    ["Offset of field: OQS_KEM::decaps"][::core::mem::offset_of!(OQS_KEM, decaps) - 88usize];
};
unsafe extern "C" {
    pub fn OQS_KEM_new(method_name: *const ::libc::c_char) -> *mut OQS_KEM;
}
unsafe extern "C" {
    pub fn OQS_KEM_keypair_derand(
        kem: *const OQS_KEM,
        public_key: *mut u8,
        secret_key: *mut u8,
        seed: *const u8,
    ) -> OQS_STATUS;
}
unsafe extern "C" {
    pub fn OQS_KEM_keypair(
        kem: *const OQS_KEM,
        public_key: *mut u8,
        secret_key: *mut u8,
    ) -> OQS_STATUS;
}
unsafe extern "C" {
    pub fn OQS_KEM_encaps(
        kem: *const OQS_KEM,
        ciphertext: *mut u8,
        shared_secret: *mut u8,
        public_key: *const u8,
    ) -> OQS_STATUS;
}
unsafe extern "C" {
    pub fn OQS_KEM_decaps(
        kem: *const OQS_KEM,
        shared_secret: *mut u8,
        ciphertext: *const u8,
        secret_key: *const u8,
    ) -> OQS_STATUS;
}
unsafe extern "C" {
    pub fn OQS_KEM_free(kem: *mut OQS_KEM);
}
